In [2]:
print('hi')

hi

Markdown : [GOOGLE](https://google.com)

Raw : 일반 텍스트

In [3]:
import pandas as pd
import numpy as np

In [4]:
print(pd.__version__)
np.__version__

1.4.2

'1.21.5'

In [5]:
a=1
b=2

In [6]:
a
b

2

print(a)
b

### 시리즈

- 같은 종류의 데이터 집합, 컬럼단위

In [7]:
pd.Series([1,2,3,np.nan,6,8])

0    1.0
1    2.0
2    3.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [8]:
pd.Series([1,2,3,5,6,8])

0    1
1    2
2    3
3    5
4    6
5    8
dtype: int64

In [9]:
pd.Series([1,3,5,7,6,8],dtype="int32")

0    1
1    3
2    5
3    7
4    6
5    8
dtype: int32

In [10]:
pd.Series([1,3,'5',7,6,8])

0    1
1    3
2    5
3    7
4    6
5    8
dtype: object

In [11]:
dates = pd.date_range('20130101',periods=6)

In [12]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [13]:
df = pd.DataFrame(np.random.randn(6,4),
             index=dates,
             columns=list("ABCD"))

In [14]:
list("ABCD")

['A', 'B', 'C', 'D']

In [15]:
pd.DataFrame(np.random.randn(6,4))

          0         1         2         3
0 -0.104999  1.049260  0.328429  0.152661
1  1.090088 -0.840781  0.712817  0.175113
2  2.825349 -0.571364 -0.233249  0.227396
3 -0.907842  0.632491  0.179649  1.596794
4 -1.002324 -1.728956 -0.142409  1.658671
5  0.172976 -0.037382  0.568558 -2.558376

In [16]:
df2 = pd.DataFrame(
    {
        "A" : 0.1,
        "B" : pd.Timestamp("20130102"),
        "C" : pd.Series(1, index=list(range(4)), dtype="float32"),
        "D" : np.array([3]*4, dtype="int32"),
        "E" : pd.Categorical(["test","train","test","train"]),
        "F" : "foo",
    }
)

In [17]:
df2

     A          B    C  D      E    F
0  0.1 2013-01-02  1.0  3   test  foo
1  0.1 2013-01-02  1.0  3  train  foo
2  0.1 2013-01-02  1.0  3   test  foo
3  0.1 2013-01-02  1.0  3  train  foo

In [18]:
type(df2)

pandas.core.frame.DataFrame

In [19]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [20]:
df2.shape

(4, 6)

In [21]:
df2.ndim

2

In [22]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       4 non-null      datetime64[ns]
 2   C       4 non-null      float32
 3   D       4 non-null      int32
 4   E       4 non-null      category
 5   F       4 non-null      object
dtypes: category(1), datetime64[ns](1), float32(1), float64(1), int32(1), object(1)
memory usage: 288.0+ bytes

In [23]:
df2.head(2)

     A          B    C  D      E    F
0  0.1 2013-01-02  1.0  3   test  foo
1  0.1 2013-01-02  1.0  3  train  foo

In [24]:
df2.tail()

     A          B    C  D      E    F
0  0.1 2013-01-02  1.0  3   test  foo
1  0.1 2013-01-02  1.0  3  train  foo
2  0.1 2013-01-02  1.0  3   test  foo
3  0.1 2013-01-02  1.0  3  train  foo

In [25]:
df2.sample(3)

     A          B    C  D      E    F
1  0.1 2013-01-02  1.0  3  train  foo
2  0.1 2013-01-02  1.0  3   test  foo
0  0.1 2013-01-02  1.0  3   test  foo

In [26]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [27]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [28]:
df2.values

array([[0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [29]:
type(df2.index)

pandas.core.indexes.numeric.Int64Index

In [30]:
type(df2.columns)

pandas.core.indexes.base.Index

In [31]:
type(df2.values)

numpy.ndarray

In [32]:
df2.to_numpy()

array([[0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [33]:
df2

     A          B    C  D      E    F
0  0.1 2013-01-02  1.0  3   test  foo
1  0.1 2013-01-02  1.0  3  train  foo
2  0.1 2013-01-02  1.0  3   test  foo
3  0.1 2013-01-02  1.0  3  train  foo

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [35]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.040577 -0.100618 -0.013203 -0.396442
std    0.818793  1.106815  0.876440  1.184202
min   -0.980202 -0.942474 -1.205281 -1.913151
25%   -0.570864 -0.679627 -0.706592 -1.083506
50%    0.041642 -0.383410  0.486940 -0.234378
75%    0.586528 -0.250724  0.593861 -0.174487
max    1.147254  2.090448  0.627120  1.524328

In [36]:
df2.describe()

         A    C    D
count  4.0  4.0  4.0
mean   0.1  1.0  3.0
std    0.0  0.0  0.0
min    0.1  1.0  3.0
25%    0.1  1.0  3.0
50%    0.1  1.0  3.0
75%    0.1  1.0  3.0
max    0.1  1.0  3.0

In [37]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.713206   -0.980202   -0.123210   -0.720082    0.206494    1.147254
B   -0.495717   -0.740930   -0.942474   -0.243931    2.090448   -0.271103
C    0.627120    0.385387    0.595651   -1.070586    0.588494   -1.205281
D   -0.276761   -0.168651    1.524328   -1.913151   -1.352420   -0.191996

In [38]:
df

                   A         B         C         D
2013-01-01  0.713206 -0.495717  0.627120 -0.276761
2013-01-02 -0.980202 -0.740930  0.385387 -0.168651
2013-01-03 -0.123210 -0.942474  0.595651  1.524328
2013-01-04 -0.720082 -0.243931 -1.070586 -1.913151
2013-01-05  0.206494  2.090448  0.588494 -1.352420
2013-01-06  1.147254 -0.271103 -1.205281 -0.191996

In [39]:
df.sort_index(ascending=False,axis=1)

                   D         C         B         A
2013-01-01 -0.276761  0.627120 -0.495717  0.713206
2013-01-02 -0.168651  0.385387 -0.740930 -0.980202
2013-01-03  1.524328  0.595651 -0.942474 -0.123210
2013-01-04 -1.913151 -1.070586 -0.243931 -0.720082
2013-01-05 -1.352420  0.588494  2.090448  0.206494
2013-01-06 -0.191996 -1.205281 -0.271103  1.147254

In [40]:
df.sort_values(by=['A','B'])

                   A         B         C         D
2013-01-02 -0.980202 -0.740930  0.385387 -0.168651
2013-01-04 -0.720082 -0.243931 -1.070586 -1.913151
2013-01-03 -0.123210 -0.942474  0.595651  1.524328
2013-01-05  0.206494  2.090448  0.588494 -1.352420
2013-01-01  0.713206 -0.495717  0.627120 -0.276761
2013-01-06  1.147254 -0.271103 -1.205281 -0.191996

In [41]:
df['A']

2013-01-01    0.713206
2013-01-02   -0.980202
2013-01-03   -0.123210
2013-01-04   -0.720082
2013-01-05    0.206494
2013-01-06    1.147254
Freq: D, Name: A, dtype: float64

In [42]:
df.loc[['2013-01-03','2013-01-05'],['B','C']]

                   B         C
2013-01-03 -0.942474  0.595651
2013-01-05  2.090448  0.588494

In [43]:
df.iloc[1:3,2:4]

                   C         D
2013-01-02  0.385387 -0.168651
2013-01-03  0.595651  1.524328

In [44]:
df[df['A']>0]

                   A         B         C         D
2013-01-01  0.713206 -0.495717  0.627120 -0.276761
2013-01-05  0.206494  2.090448  0.588494 -1.352420
2013-01-06  1.147254 -0.271103 -1.205281 -0.191996

In [45]:
df['A']>0

2013-01-01     True
2013-01-02    False
2013-01-03    False
2013-01-04    False
2013-01-05     True
2013-01-06     True
Freq: D, Name: A, dtype: bool

In [46]:
df[df>0]

                   A         B         C         D
2013-01-01  0.713206       NaN  0.627120       NaN
2013-01-02       NaN       NaN  0.385387       NaN
2013-01-03       NaN       NaN  0.595651  1.524328
2013-01-04       NaN       NaN       NaN       NaN
2013-01-05  0.206494  2.090448  0.588494       NaN
2013-01-06  1.147254       NaN       NaN       NaN

In [47]:
df2 = df.copy()

In [48]:
df2['E']=["one", "one", "two", "three", "four", "three"]

In [49]:
df2

                   A         B         C         D      E
2013-01-01  0.713206 -0.495717  0.627120 -0.276761    one
2013-01-02 -0.980202 -0.740930  0.385387 -0.168651    one
2013-01-03 -0.123210 -0.942474  0.595651  1.524328    two
2013-01-04 -0.720082 -0.243931 -1.070586 -1.913151  three
2013-01-05  0.206494  2.090448  0.588494 -1.352420   four
2013-01-06  1.147254 -0.271103 -1.205281 -0.191996  three

In [50]:
df

                   A         B         C         D
2013-01-01  0.713206 -0.495717  0.627120 -0.276761
2013-01-02 -0.980202 -0.740930  0.385387 -0.168651
2013-01-03 -0.123210 -0.942474  0.595651  1.524328
2013-01-04 -0.720082 -0.243931 -1.070586 -1.913151
2013-01-05  0.206494  2.090448  0.588494 -1.352420
2013-01-06  1.147254 -0.271103 -1.205281 -0.191996

In [51]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.123210 -0.942474  0.595651  1.524328   two
2013-01-05  0.206494  2.090448  0.588494 -1.352420  four

In [52]:
df2[(df2['E']=='two')|(df2['E']=='four')]

                   A         B         C         D     E
2013-01-03 -0.123210 -0.942474  0.595651  1.524328   two
2013-01-05  0.206494  2.090448  0.588494 -1.352420  four

In [53]:
df

                   A         B         C         D
2013-01-01  0.713206 -0.495717  0.627120 -0.276761
2013-01-02 -0.980202 -0.740930  0.385387 -0.168651
2013-01-03 -0.123210 -0.942474  0.595651  1.524328
2013-01-04 -0.720082 -0.243931 -1.070586 -1.913151
2013-01-05  0.206494  2.090448  0.588494 -1.352420
2013-01-06  1.147254 -0.271103 -1.205281 -0.191996

In [54]:
df1 = df.reindex(index=dates[0:4],
                columns=list(df.columns)+['E'])

In [55]:
df1

                   A         B         C         D   E
2013-01-01  0.713206 -0.495717  0.627120 -0.276761 NaN
2013-01-02 -0.980202 -0.740930  0.385387 -0.168651 NaN
2013-01-03 -0.123210 -0.942474  0.595651  1.524328 NaN
2013-01-04 -0.720082 -0.243931 -1.070586 -1.913151 NaN

In [56]:
df1.loc[dates[0]:dates[1],'E']=1

In [57]:
df4=df1.copy()

In [58]:
df4

                   A         B         C         D    E
2013-01-01  0.713206 -0.495717  0.627120 -0.276761  1.0
2013-01-02 -0.980202 -0.740930  0.385387 -0.168651  1.0
2013-01-03 -0.123210 -0.942474  0.595651  1.524328  NaN
2013-01-04 -0.720082 -0.243931 -1.070586 -1.913151  NaN

In [59]:
df4.dropna(how='any',axis=0)

                   A         B         C         D    E
2013-01-01  0.713206 -0.495717  0.627120 -0.276761  1.0
2013-01-02 -0.980202 -0.740930  0.385387 -0.168651  1.0

In [60]:
df4=df1.copy()

In [61]:
df4.dropna(how='any',axis=1)

                   A         B         C         D
2013-01-01  0.713206 -0.495717  0.627120 -0.276761
2013-01-02 -0.980202 -0.740930  0.385387 -0.168651
2013-01-03 -0.123210 -0.942474  0.595651  1.524328
2013-01-04 -0.720082 -0.243931 -1.070586 -1.913151

In [62]:
df1 = df.reindex(index=dates[0:4],
                columns=list(df.columns)+['E'])
df1.loc[dates[0]:dates[1],'E']=1
df1

                   A         B         C         D    E
2013-01-01  0.713206 -0.495717  0.627120 -0.276761  1.0
2013-01-02 -0.980202 -0.740930  0.385387 -0.168651  1.0
2013-01-03 -0.123210 -0.942474  0.595651  1.524328  NaN
2013-01-04 -0.720082 -0.243931 -1.070586 -1.913151  NaN

In [63]:
df1.fillna(df1.mean())

                   A         B         C         D    E
2013-01-01  0.713206 -0.495717  0.627120 -0.276761  1.0
2013-01-02 -0.980202 -0.740930  0.385387 -0.168651  1.0
2013-01-03 -0.123210 -0.942474  0.595651  1.524328  1.0
2013-01-04 -0.720082 -0.243931 -1.070586 -1.913151  1.0

In [64]:
df1 = df.reindex(index=dates[0:4],
                columns=list(df.columns)+['E'])
df1.loc[dates[0]:dates[1],'E']=1
df1.loc[dates[0],'A']=np.nan
df1.loc[dates[1],'B']=np.nan
df1.loc[dates[3],'C']=np.nan
df1.loc[dates[1],'D']=np.nan
df1

                   A         B         C         D    E
2013-01-01       NaN -0.495717  0.627120 -0.276761  1.0
2013-01-02 -0.980202       NaN  0.385387       NaN  1.0
2013-01-03 -0.123210 -0.942474  0.595651  1.524328  NaN
2013-01-04 -0.720082 -0.243931       NaN -1.913151  NaN

In [65]:
df1.mean()

A   -0.607831
B   -0.560707
C    0.536052
D   -0.221862
E    1.000000
dtype: float64

In [66]:
df1.fillna(df1.mean())

                   A         B         C         D    E
2013-01-01 -0.607831 -0.495717  0.627120 -0.276761  1.0
2013-01-02 -0.980202 -0.560707  0.385387 -0.221862  1.0
2013-01-03 -0.123210 -0.942474  0.595651  1.524328  1.0
2013-01-04 -0.720082 -0.243931  0.536052 -1.913151  1.0

In [67]:
pd.isna(df1)

                A      B      C      D      E
2013-01-01   True  False  False  False  False
2013-01-02  False   True  False   True  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False   True  False   True

In [68]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 4 entries, 2013-01-01 to 2013-01-04
Freq: D
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      float64
 1   B       3 non-null      float64
 2   C       3 non-null      float64
 3   D       3 non-null      float64
 4   E       2 non-null      float64
dtypes: float64(5)
memory usage: 364.0 bytes

In [69]:
df1.isna()

                A      B      C      D      E
2013-01-01   True  False  False  False  False
2013-01-02  False   True  False   True  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False   True  False   True

In [70]:
df1.isna().sum()/df1.shape[1]

A    0.2
B    0.2
C    0.2
D    0.2
E    0.4
dtype: float64

In [71]:
df1.isna().sum().sum()

6

In [72]:
df1.count()

A    3
B    3
C    3
D    3
E    2
dtype: int64

In [73]:
df.mean(1)

2013-01-01    0.141962
2013-01-02   -0.376099
2013-01-03    0.263574
2013-01-04   -0.986937
2013-01-05    0.383254
2013-01-06   -0.130282
Freq: D, dtype: float64

In [74]:
df.std()

A    0.818793
B    1.106815
C    0.876440
D    1.184202
dtype: float64

In [75]:
df

                   A         B         C         D
2013-01-01  0.713206 -0.495717  0.627120 -0.276761
2013-01-02 -0.980202 -0.740930  0.385387 -0.168651
2013-01-03 -0.123210 -0.942474  0.595651  1.524328
2013-01-04 -0.720082 -0.243931 -1.070586 -1.913151
2013-01-05  0.206494  2.090448  0.588494 -1.352420
2013-01-06  1.147254 -0.271103 -1.205281 -0.191996

In [76]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01  0.713206 -0.495717  0.627120 -0.276761
2013-01-02 -0.266996 -1.236646  1.012507 -0.445412
2013-01-03 -0.390206 -2.179121  1.608157  1.078916
2013-01-04 -1.110288 -2.423052  0.537572 -0.834235
2013-01-05 -0.903794 -0.332603  1.126065 -2.186656
2013-01-06  0.243460 -0.603706 -0.079216 -2.378651

In [77]:
def dataa(x):
    return x.max()-x.min()

df.apply(dataa)

A    2.127455
B    3.032923
C    1.832402
D    3.437479
dtype: float64

In [78]:
df.apply(lambda x: x.max()-x.min())

A    2.127455
B    3.032923
C    1.832402
D    3.437479
dtype: float64

In [79]:
gender=pd.Series(['남자','여자','여자','여자','남','male'])

In [80]:
gender.value_counts()

여자      3
남자      1
남       1
male    1
dtype: int64

In [81]:
gender.replace(['남','male'],['남자','남자'])

0    남자
1    여자
2    여자
3    여자
4    남자
5    남자
dtype: object

In [82]:
gender.replace('male','남자')

0    남자
1    여자
2    여자
3    여자
4     남
5    남자
dtype: object

In [83]:
df=pd.DataFrame(np.random.randn(10,4))

In [84]:
df

          0         1         2         3
0  0.272973 -0.345672 -1.505577  1.034535
1 -1.006485 -0.790857 -2.535760 -1.316784
2 -0.158917  0.098461  0.370902 -0.921377
3 -0.513931  0.152863  1.406674  0.208837
4 -0.924772  0.934065  1.019601 -1.273373
5  1.430511 -0.111649  0.358231  0.371587
6 -0.231324  1.772238  0.771455 -0.459349
7  1.956571  0.603895 -1.153697 -0.015128
8 -0.792831 -0.748402 -1.077307  0.411236
9 -0.069776  1.519158 -0.077089  0.980680

In [85]:
pieces = [df[:3],df[3:7],df[7:]]

In [86]:
pieces[0]

          0         1         2         3
0  0.272973 -0.345672 -1.505577  1.034535
1 -1.006485 -0.790857 -2.535760 -1.316784
2 -0.158917  0.098461  0.370902 -0.921377

In [87]:
pieces[1]

          0         1         2         3
3 -0.513931  0.152863  1.406674  0.208837
4 -0.924772  0.934065  1.019601 -1.273373
5  1.430511 -0.111649  0.358231  0.371587
6 -0.231324  1.772238  0.771455 -0.459349

In [88]:
pieces[2]

          0         1         2         3
7  1.956571  0.603895 -1.153697 -0.015128
8 -0.792831 -0.748402 -1.077307  0.411236
9 -0.069776  1.519158 -0.077089  0.980680

In [89]:
pd.concat([pieces[0],pieces[1],pieces[2]],axis=1)

,0,1,2,3,0,1,2,3,0,1,2,3
0,0.272973,-0.345672,-1.505577,1.034535,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,-1.006485,-0.790857,-2.535760,-1.316784,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,-0.158917,0.098461,0.370902,-0.921377,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,-0.513931,0.152863,1.406674,0.208837,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,-0.924772,0.934065,1.019601,-1.273373,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,1.430511,-0.111649,0.358231,0.371587,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,-0.231324,1.772238,0.771455,-0.459349,NaN,NaN,NaN,NaN
7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.956571,0.603895,-1.153697,-0.015128
8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,-0.792831,-0.748402,-1.077307,0.411236
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,-0.069776,1.519158,-0.077089,0.980680

In [90]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})

In [91]:
left

   key  lval
0  foo     1
1  foo     2

In [92]:
right

   key  rval
0  foo     4
1  foo     5

In [93]:
pd.merge(left,right,on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [94]:
pd.merge(left,right,left_on='key',right_on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [95]:
left.set_index('key',inplace=True)
right.set_index('key',inplace=True)

In [96]:
left.join(right)

     lval  rval
key
foo     1     4
foo     1     5
foo     2     4
foo     2     5

In [97]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

In [98]:
df

     A      B         C         D
0  foo    one  1.520885 -1.809901
1  bar    one -0.880963  1.113456
2  foo    two -1.455074  1.066198
3  bar  three -1.195890  2.155902
4  foo    two -0.513540  2.049043
5  bar    two  0.233776 -0.129195
6  foo    one  0.335245 -0.512851
7  foo  three  0.146747  0.509564

In [99]:
df.sum()

A        foobarfoobarfoobarfoofoo
B    oneonetwothreetwotwoonethree
C                       -1.808814
D                        4.442216
dtype: object

In [100]:
test=df.groupby(['A','B']).sum()

In [101]:
test

                  C         D
A   B
bar one   -0.880963  1.113456
    three -1.195890  2.155902
    two    0.233776 -0.129195
foo one    1.856130 -2.322753
    three  0.146747  0.509564
    two   -1.968613  3.115240

In [102]:
test1=test.stack()

In [103]:
test1.unstack(0)

A             bar       foo
B
one   C -0.880963  1.856130
      D  1.113456 -2.322753
three C -1.195890  0.146747
      D  2.155902  0.509564
two   C  0.233776 -1.968613
      D -0.129195  3.115240

In [104]:
df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["A", "B", "C"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)

In [105]:
df

        A  B    C         D         E
0     one  A  foo  0.215086  0.069959
1     one  B  foo -0.008531  0.346691
2     two  C  foo -1.138056 -0.469200
3   three  A  bar  0.106245  0.237798
4     one  B  bar -0.877048 -0.752777
5     one  C  bar -1.267545  1.167339
6     two  A  foo  1.584694  1.145964
7   three  B  foo -1.164619  0.912317
8     one  C  foo -1.141368  0.820161
9     one  A  bar  0.917457  1.581033
10    two  B  bar -1.515486 -0.776978
11  three  C  bar -2.357272  0.178018

In [106]:
test=pd.pivot_table(df,values='D',index=['A','B'],columns=['C'],aggfunc='sum')

In [107]:
test

C             bar       foo
A     B
one   A  0.917457  0.215086
      B -0.877048 -0.008531
      C -1.267545 -1.141368
three A  0.106245       NaN
      B       NaN -1.164619
      C -2.357272       NaN
two   A       NaN  1.584694
      B -1.515486       NaN
      C       NaN -1.138056

In [108]:
test.melt()

      C     value
0   bar  0.917457
1   bar -0.877048
2   bar -1.267545
3   bar  0.106245
4   bar       NaN
5   bar -2.357272
6   bar       NaN
7   bar -1.515486
8   bar       NaN
9   foo  0.215086
10  foo -0.008531
11  foo -1.141368
12  foo       NaN
13  foo -1.164619
14  foo       NaN
15  foo  1.584694
16  foo       NaN
17  foo -1.138056

In [109]:
test.head(3)

C           bar       foo
A   B
one A  0.917457  0.215086
    B -0.877048 -0.008531
    C -1.267545 -1.141368

In [110]:
test.reset_index(inplace=True)

In [111]:
test.head(2)

C    A  B       bar       foo
0  one  A  0.917457  0.215086
1  one  B -0.877048 -0.008531

In [112]:
test.melt(id_vars=['A','B'])

        A  B    C     value
0     one  A  bar  0.917457
1     one  B  bar -0.877048
2     one  C  bar -1.267545
3   three  A  bar  0.106245
4   three  B  bar       NaN
5   three  C  bar -2.357272
6     two  A  bar       NaN
7     two  B  bar -1.515486
8     two  C  bar       NaN
9     one  A  foo  0.215086
10    one  B  foo -0.008531
11    one  C  foo -1.141368
12  three  A  foo       NaN
13  three  B  foo -1.164619
14  three  C  foo       NaN
15    two  A  foo  1.584694
16    two  B  foo       NaN
17    two  C  foo -1.138056

In [115]:
data=pd.read_csv("전라북도_소방서별 소방자동차 현황_20170810.csv",encoding='utf8')
data.head(2)

,시군,고가차 53(m),고가차 52(m),고가차 46(m),굴 절차 36(m),굴 절차 28(m),굴 절차 27(m),배 연 차,구 급 차,구조차 버스,...,굴 삭 기,"트레일러 공기,양수",트레일러 보트,이동정비차,이동체험차,장비운반차,이동중계차,산불진화차,유 조 차,버 스
0,본부,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,1.0,1.0,1.0,1,1.0,NaN,1.0,2.0
1,덕진,1.0,NaN,NaN,NaN,NaN,1.0,NaN,10.0,1.0,...,NaN,1.0,1.0,NaN,NaN,1,NaN,1.0,NaN,NaN

In [195]:
data.melt(id_vars='시군')

      시군   variable  value
0     본부  고가차 53(m)    NaN
1     덕진  고가차 53(m)    1.0
2     완산  고가차 53(m)    NaN
3     군산  고가차 53(m)    NaN
4     익산  고가차 53(m)    1.0
..   ...        ...    ...
369   남원      버   스    NaN
370   김제      버   스    NaN
371   고창      버   스    NaN
372   부안      버   스    NaN
373  무진장      버   스    NaN

[374 rows x 3 columns]